Repository: froemken/mysqlreport
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# clearCache.title
source: Clear MySQL Profiles
de: MySQL Profiles löschen

# clearCache.description
source: Clear collected profile records of extension mysqlreport. This table can grow very fast, so maybe it is good to clear this table.
de: Lösche die gesammelten MySQL Profiles der mysqlreports extension. Die Tabelle kann sehr schnell wachsen, von daher sollte diese durchaus mal geleert werden.

# report_title
source: MySQL Check
de: MySQL Überprüfung

# report_description
source: With this report you can test/check your MySQL-Server
de: Dieser Bericht gibt Dir einen Überblick über Deinen MySQL-Server und einige Tipps die Geschwindigkeit zu verbessern

# tableCache
source: Since MySQL 5.1.3 the table_cache-Variable was splitted into table_open_cache and table_definition_cache. So it's easy to forget to set the definition cache while updating to newer MysQL-Versions. The table_open_cache manages the filehandler to the tablefiles. With f.e. PHP:fopen() you can open such filehandler, too. But in MySQL there can be many clients connect to the same tablefile. In case of your storage engine it could be that a new handle will be created with each new connection to the DB. A too high value can result into problems, because the operationsystem can handle only a maximum of filehandles. You can check this on unix systems in: /proc/sys/fs/file-max. The defaultvalue is 400 and was set to 2000 in MySQL 5.6.8. The table_definition_cache does not use these filehandlers, is smaller as table_open_cache and contains f.e. the structure of the table (*.frm). The defaultvalue is 400 and will be managed automatically since MySQL 5.6.8 (-1).
de: Seit MySQL 5.1.3 wurde die table_cache-Variable ausgesplittet in table_open_cache und table_definition_cache. Gerade bei Updates wird schon mal gerne vergessen den Definitionscache anzupassen. Der table_open_cache stellt die Dateihandler zu den Tabellendateien dar. Mit PHP:fopen() z.B. wird auch so ein Dateihandle erzeugt. Bei MySQL können aber durchaus auch mehrere Clients auf ein und dieselbe Tabelle zugreifen. Je nach Storageengine wird dann pro Verbindung ein zusätzliches Handle erzeugt. Ein zu hoher Wert kann aber auch zu Problemen führen, denn das Betriebssystem stellt nur eine maximale Anzahl an Dateihandler zur verfügung. Bei Unixsystemen zu sehen in: /proc/sys/fs/file-max. Der Defaultwert liegt bei 400 und wurde seit 5.6.8 auf 2000 erhöht. Der table_definition_cache benötigt keine dieser Dateihandler, ist kleiner als der table_open_cache und beinhaltet z.B. die Struktur (*.frm) der Tabellen. Der Defaultwert liegt bei 400 und wird ab MySQL 5.6.8 automatisch verwaltet (-1).

# freeTableDefinitions.title
source: Free entries in Definitioncache
de: Freie Einträge im Definitionscache

# freeTableDefinitions.description
source: Personnel I think you should always have at least 10% free in Definitioncache. If the value of Opened_table_definitions is high, you should increase table_definition_cache.
de: Ich persönlich finde, es sollten immer so 10% im Definitionscache frei sein. Aber im Grunde entscheidet sich das über den Wert Opened_table_definitions. Wenn dieser besonders hoch ist, dann sollten Sie den Wert table_definition_cache erhöhen.

# freeOpenTables.title
source: Free entries in Table open cache
de: Freie Einträge im Table Open Cache

# freeOpenTables.description
source: Personnel I think you should always have at least 10% free in Tablecache. If the value of Opened_tables is high, you should increase table_open_cache.
de: Ich persönlich finde, es sollten immer so 10% im Tablecache frei sein. Aber im Grunde entscheidet sich das über den Wert Opened_tables. Wenn dieser besonders hoch ist, dann sollten Sie den Wert table_open_cache erhöhen.

# openedDefinitionsEachSecond.title
source: Opened Definitions each second
de: Geöffnete Definitionen pro Sekunde

# openedDefinitionsEachSecond.description
source: Here you can see how many Definitions the server has to open within one second. Personnel I think a value between 0 and 3 should be OK. But if the value is higher than 10 you should increase the value of table_definition_cache.
de: Hier könnt Ihr sehen, wie viele Definitionen der Server im Durchschnitt pro Sekunde öffnen musste. Ich persönlich finde einen Wert von 0-3 völlig OK. Sollte der Wert jedoch über 10 steigen, solltet Ihr den Wert table_definition_cache höher setzen.

# openedTablesEachSecond.title
source: Opened tableinformations each second
de: Geöffnete Tabelleninformationen pro Sekunde

# openedTablesEachSecond.description
source: Here you can see how many tablefilehandler the server has to open within one second. Personnel I think a value between 0 and 3 should be OK. But if the value is higher than 10 you should increase the value of table_open_cache.
de: Hier könnt Ihr sehen, wie viele Tabellenhandler der Server im Durchschnitt pro Sekunde erstellen musste. Ich persönlich finde einen Wert von 0-3 völlig OK. Sollte der Wert jedoch über 10 steigen, solltet Ihr den Wert table_open_cache höher setzen.

# createdThreadsEachSecond.title
source: Created Threads each second
de: Erstellte Threads pro Sekunde

# createdThreadsEachSecond.description
source: 0-3 should be OK. If value is above 10 you should increase thread_cache_size
de: 0-3 sollte OK sein. Sollte der Wert allerdings über 10 gehen, dann sollten Sie den Wert für thread_cache_size entsprechend anpassen

# sumOfAllThreadsInBytes.title
source: Sum of all created threads in byte
de: Summe aller erstellten Threads in Byte

# sumOfAllThreadsInBytes.description
source: Each creation of a thread costs 256KB. This value shows the total costs of all created threads
de: Jede Threaderstellung kostet 256KB und wird bei Nichtverwendung wieder freigegeben. Dieser Wert summiert alle erstellten Threads in Byte.

# cacheHitRatioBook.description
source: This calculation I have from this book "High Performance MySQL" given in percent. As higher as better.
de: Diese Berechnung habe ich aus dem Buch "High Performance MySQL". Angabe in Prozent. Je höher desto besser. Jedoch liegt zwischen 99% und 99,9% eine Leistungssteigerung von 10% vor.

# cacheHitRatioMySql.description
source: This calculation I have from MySQL-Website. The value should be near 0.01. As smaller as better.
de: Diese Berechnung habe ich von der MySQL-Webseite. Der Wert sollte um die 0.01 liegen. Je kleiner je besser.

# cacheHitRatio.description
source: Personal calculation. Schould be higher than 100.
de: Persönliche Berechnung. Wenn wir davon ausgehen, dass das Verhältnis zwischen RAM und HDD bei einer Geschwindigkeit von 100 zu 1 liegt, dann sollte dieser Wert hier über 100 liegen.

# cacheMisses.description
source: How ofter MySQL have to access the HDD instead of RAM. As lower as better. 5 should be OK, but 80 is really high.
de: Wie oft musste MySQL pro Sekunde auf die Festplatte zugreifen, um einen Indexeintrag auszulesen. Je höher desto schlechter. 5 mag OK sein. 80 ist jedoch schon heftig viel

# usedBuffer.title
source: Used KeyBuffer
de: Verwendeter Buffer

# usedBuffer.description
source: Used KeyBuffer in percent
de: Zu wie viel Prozent wird der KeyBuffer derzeit verwendet?

# myIsamIndexSize.title
source: Indexsize
de: Indexgröße

# myIsamIndexSize.description
source: Sum of all MyISAM-Indexes. He should be smaller than key_buffer_size. If not, key_buffer_size should not be higher than 25-33% of RAM.
de: Summe aller MyISAM-Indexes. Er sollte kleiner sein als die key_buffer_size. Falls das nicht geht, dann sollte die key_buffer_size 25-33% des RAMS nicht übersteigen.

# dashboard.mysqlreport.description
source: Create a new dashboard with a lot of widgets about the health of the currently used database
de: Erstellt ein Dashboard mit einer Vielzahl an Widgets über den Gesundheitszustand der aktuell verwendeten Datenbank

# widget.maxUsedConnections.title
source: Max Used DB Connections
de: Max. verwendete DB Verbindungen

# widget.maxUsedConnections.description
source: Shows used and max DB connections
de: Zeigt verwendete und maximale DB Verbindungen an

# widget.innoDbBuffer.description
source: Shows a chart with used, misc and free InnoDB buffer
de: Zeigt ein Diagramm über verwendeten, sonstigen und freiem InnoDB Buffer

# widget.createdTempTables.title
source: Created Temp Tables
de: Temporär erstellte Tabellen

# widget.createdTempTables.description
source: Shows a chart how many temporary tables were created on disk and in RAM
de: Zeigt ein Diagramm wie viele temporäre Tabellen sowohl auf der Festplatte als auch im RAM angelegt wurden

# widget.handlerReadNext.title
source: Statistic: FTS
de: Statistik: FTS

# widget.handlerReadNext.description
source: Shows a chart how many records could be read by index and how many have to be read by FTS (Full Table Scan)
de: Zeigt ein Diagramm wie viele Datensätze mit Hilfe eines Index und wie viele Datensätze über FTS (Full Table Scan) eingelesen werden
